; domain
(define (domain rescue_sys)
    (:requirements :negative-preconditions :typing :conditional-effects)

    (:types
        zone locatable slot - object
        movable fixed - locatable
        person - fixed
        box content robot carrier - movable
    )

    (:predicates
        (at ?obj - locatable ?zone - zone)
        (free-box ?box - box)
        (box-filled ?box - box ?cont - content)
        (box-on-carrier ?box - box ?car - carrier)
        (person-has-content ?per - person ?cont - content)
        (person-needs-content ?per - person ?cont - content)
        (free-slot ?slot - slot)
        (slot-of-carrier ?slot - slot ?car - carrier)
    )

    (:action put-content-in-box
        :parameters (?box - box ?cont - content ?rob - robot ?zone - zone
        )
        :precondition (and
            (free-box ?box)
            (at ?cont ?zone)
            (at ?box ?zone)
            (at ?rob ?zone)
        )
        :effect (and
            (box-filled ?box ?cont)
            (not (free-box ?box))
        )
    )

    (:action drop-content-of-box
        :parameters (?box - box ?cont - content ?rob - robot ?per - person ?zone - zone
        )
        :precondition (and
            (box-filled ?box ?cont)
            (at ?box ?zone)
            (at ?rob ?zone)
            (at ?per ?zone)
            (person-needs-content ?per ?cont)
        )
        :effect (and
            (not (box-filled ?box ?cont))
            (free-box ?box)
            (person-has-content ?per ?cont)
            (not (person-needs-content ?per ?cont))
        )
    )

    (:action put-box-on-carrier
        :parameters (?box - box ?car - carrier ?rob - robot ?zone - zone ?slot - slot
        )
        :precondition (and
            (at ?box ?zone)
            (at ?car ?zone)
            (at ?rob ?zone)
            (slot-of-carrier ?slot ?car)
            (free-slot ?slot)
        )
        :effect (and
            (not (at ?box ?zone))
            (box-on-carrier ?box ?car)
            (not (free-slot ?slot))
        )
    )

    (:action drop-box-of-carrier
        :parameters (?box - box ?car - carrier ?rob - robot ?zone - zone ?slot - slot
        )
        :precondition (and
            (at ?car ?zone)
            (at ?rob ?zone)
            (box-on-carrier ?box ?car)
            (slot-of-carrier ?slot ?car)
            (not (free-slot ?slot))
        )
        :effect (and
            (at ?box ?zone)
            (not (box-on-carrier ?box ?car))
            (free-slot ?slot)
        )
    )

    (:action move-robot
        :parameters (?rob - robot ?from - zone ?to - zone
        )
        :precondition (and (at ?rob ?from))
        :effect (and
            (not (at ?rob ?from))
            (at ?rob ?to)
        )
    )

    (:action move-robot-with-carrier
        :parameters (?rob - robot ?car - carrier ?from - zone ?to - zone
        )
        :precondition (and
            (at ?rob ?from)
            (at ?car ?from)
        )
        :effect (and
            (not (at ?rob ?from))
            (at ?rob ?to)
            (not (at ?car ?from))
            (at ?car ?to)
        )
    )
)

; problem
(define (problem rescue_inst_1)
    (:domain rescue_sys)

    (:objects
        depot zone1 zone2 - zone
        b1 b2 b3 b4 b5 - box
        p1 p2 p3 - person
        r - robot
        car - carrier
        sl1 sl2 sl3 sl4 - slot
        drugs food tools - content
    )
    (:init
        (at b1 depot)
        (at b2 depot)
        (at b3 depot)
        (at b4 depot)
        (at b5 depot)

        (at r depot)
        (at car depot)

        (at food depot)
        (at drugs depot)
        (at tools depot)

        (at p1 zone1)
        (at p2 zone1)
        (at p3 zone2)

        (person-needs-content p1 food)
        (person-needs-content p1 drugs)

        (person-needs-content p2 drugs)

        (person-needs-content p3 food)

        (free-box b1)
        (free-box b2)
        (free-box b3)
        (free-box b4)
        (free-box b5)

        (free-slot sl1)
        (free-slot sl2)
        (free-slot sl3)
        (free-slot sl4)

        (slot-of-carrier sl1 car)
        (slot-of-carrier sl2 car)
        (slot-of-carrier sl3 car)
        (slot-of-carrier sl4 car)
    )
    (:goal
        (and
            ; Person 1
            (person-has-content p1 food)
            (person-has-content p1 drugs)
            ; Person 2
            (person-has-content p2 drugs)
            ; Person 3
            (person-has-content p3 food)
        )
    )
)

; plan
1. (put-content-in-box b4 drugs r depot)
   deleted: (free-box b4)
   added: (box-filled b4 drugs)
   goals met: 0 of 4
2. (put-box-on-carrier b4 car r depot sl1)
   deleted: (at b4 depot) (free-slot sl1)
   added: (box-on-carrier b4 car)
   goals met: 0 of 4
3. (put-content-in-box b5 drugs r depot)
   deleted: (free-box b5)
   added: (box-filled b5 drugs)
   goals met: 0 of 4
4. (put-box-on-carrier b5 car r depot sl2)
   deleted: (at b5 depot) (free-slot sl2)
   added: (box-on-carrier b5 car)
   goals met: 0 of 4
5. (put-content-in-box b2 food r depot)
   deleted: (free-box b2)
   added: (box-filled b2 food)
   goals met: 0 of 4
6. (put-box-on-carrier b2 car r depot sl3)
   deleted: (at b2 depot) (free-slot sl3)
   added: (box-on-carrier b2 car)
   goals met: 0 of 4
7. (put-content-in-box b1 food r depot)
   deleted: (free-box b1)
   added: (box-filled b1 food)
   goals met: 0 of 4
8. (put-box-on-carrier b1 car r depot sl4)
   deleted: (at b1 depot) (free-slot sl4)
   added: (box-on-carrier b1 car)
   goals met: 0 of 4
9. (move-robot-with-carrier r car depot zone1)
   deleted: (at r depot) (at car depot)
   added: (at r zone1) (at car zone1)
   goals met: 0 of 4
10. (drop-box-of-carrier b4 car r zone1 sl2)
   deleted: (box-on-carrier b4 car)
   added: (at b4 zone1) (free-slot sl2)
   goals met: 0 of 4
11. (drop-content-of-box b4 drugs r p1 zone1)
   deleted: (box-filled b4 drugs) (person-needs-content p1 drugs)
   added: (free-box b4) (person-has-content p1 drugs)
   goals met: 1 of 4
12. (drop-box-of-carrier b5 car r zone1 sl1)
   deleted: (box-on-carrier b5 car)
   added: (at b5 zone1) (free-slot sl1)
   goals met: 1 of 4
13. (drop-content-of-box b5 drugs r p2 zone1)
   deleted: (box-filled b5 drugs) (person-needs-content p2 drugs)
   added: (free-box b5) (person-has-content p2 drugs)
   goals met: 2 of 4
14. (drop-box-of-carrier b2 car r zone1 sl3)
   deleted: (box-on-carrier b2 car)
   added: (at b2 zone1) (free-slot sl3)
   goals met: 2 of 4
15. (drop-content-of-box b2 food r p1 zone1)
   deleted: (box-filled b2 food) (person-needs-content p1 food)
   added: (free-box b2) (person-has-content p1 food)
   goals met: 3 of 4
16. (move-robot-with-carrier r car zone1 zone2)
   deleted: (at r zone1) (at car zone1)
   added: (at r zone2) (at car zone2)
   goals met: 3 of 4
17. (drop-box-of-carrier b1 car r zone2 sl4)
   deleted: (box-on-carrier b1 car)
   added: (at b1 zone2) (free-slot sl4)
   goals met: 3 of 4
18. (drop-content-of-box b1 food r p3 zone2)
   deleted: (box-filled b1 food) (person-needs-content p3 food)
   added: (free-box b1) (person-has-content p3 food)
   goals met: 4 of 4
